import os
os.system('cls' if os.name == 'nt' else 'clear')

### Списки:
# 1. Робота із списками:
# Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список
list = []

list.append(10)
list.append(20)
print(list)

list.pop(0)
print(list)

# 2. **Знаходження суми:**
# Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.
list_2 = [23, 545, 6776, 76]
sum_list_2 = sum(list_2)
print(sum_list_2)

# 3. **Подвійні значення:**
# Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
list_3 = [1, 2, 3, 4, 5]
print(list_3)
doubled_list_3 = [num *2 for num in list_3]
print('Doubled numbers: ', doubled_list_3)

### Кортежі:
# 1. **Робота із кортежами:**
# Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.
tuple = ("яблуко", "банан", "апельсин")
print(tuple[0])
print(tuple[1])
print(tuple[2])

# 2. **Об'єднання кортежів:**
# Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.
tuple_2_1 = (1, 2, 3, 4, 5)
tuple_2_2 = (6, 7, 8, 9, 10)
full_tuple = tuple_2_1 + tuple_2_2
print(full_tuple)

### Словники:
# 1. **Робота із словниками:**
# Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.
dict = {
    'name': 'Oleksandr Usyk',
    'age': '36',
    'team': 'Boxing Usyk Team'
}

print(dict)

# 2. **Оновлення словника:**
# Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.
dict_2 = {
    'Кладовище домашніх тварин': '2010'
}
print(dict_2)

dict_2.update({
    'Воно': '2011'
})
print(dict_2)

# 3. **Пошук значення:**
# Завдання: Створіть словник, що містить інформацію про країни та їх столиці.
# Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).
dict_3 = {
    "Україна": "Київ",
    "Франція": "Париж",
    "Німеччина": "Берлін",
    "Італія": "Рим",
    "США": "Вашингтон"
}
country = input("Введіть назву країни: ")

if country in dict_3:
    print(f"Столиця {country}: {dict_3[country]}")
else:
    print(f"На жаль, інформації про країну '{country}' немає у словнику.")